{
  "preRequisites:11": [
    1009
  ],
  "properties:10": {
    "betterquesting:10": {
      "autoclaim:1": 0,
      "desc:8": "§oThings are about to get complicated!§r\n\nThis quest will explain a mechanic of the Assembly Line: §dOrdered Inputs§r.\n\nThe Assembly Line requires the Item Inputs to appear in the same order as the recipe does in JEI. \n\nThis means that the top left input must come first, the top right input must be 4th, and the bottom right input must come last, for example.\n\nIf enabled in the config (more on this at the end), Fluid Inputs can also be ordered. This is §csignificantly more difficult to automate§r, and it is §aoff by default§r. Enable it if you want more of a challenge!\n\n§9How to automate Ordered Item Inputs:§r\n\nThere are many ways to automate Ordered Items: GT item pipes, redstone, other mods, you name it! This quest will give a specific recommendation using §3AE2§r.\n\nHave your Interface containing the patterns face an §3Item P2P§r. Set two output P2Ps: one into the first §3Input Bus§r, and the other into §3Item Pipes§r. Make your Item Pipes connect to all Input Buses including the first.\nDo not forget §dBlocking Mode§r, and you have got yourself an easy automation! This will also work flawlessly once we inevitably add ordered item inputs.\n\n§9How to automate Ordered Fluid Inputs:§r\n\nThis one is... more difficult. Fluid Pipes behave very different compared to Item Pipes, so you §4cannot§r use the same solution as above. You can automate the fluids in a few different ways: §3crafting cells of fluids§r or AE2FCR with §3Fluid Packet Decoders§r. The decoder route is much better, and involves outputting the fluids as fluid packets directly, then decoding them in the right location. This quest won\u0027t explain how to do this entirely due to it being off by default, so the full solution is left as an exercise to the reader.\n\n§eConfigs§r: If you find this mechanic unfun, it can be disabled with the config §5\"B:orderedAssembly\"§r for Ordered Items and §5\"B:orderedFluidAssembly\"§r for Ordered Fluids. We strongly encourage you to try Ordered Items out before disabling it right away.",
      "frame:8": "ROUNDED_SQUARE",
      "globalshare:1": 0,
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 1150,
        "OreDict:8": "",
        "id:8": "gregtech:machine"
      },
      "ignoresview:1": 0,
      "ismain:1": 0,
      "issilent:1": 0,
      "lockedprogress:1": 0,
      "name:8": "Ordered Assembly",
      "questlogic:8": "AND",
      "repeat_relative:1": 1,
      "repeattime:3": -1,
      "simultaneous:1": 0,
      "snd_complete:8": "minecraft:entity.player.levelup",
      "snd_update:8": "minecraft:entity.player.levelup",
      "tasklogic:8": "AND",
      "visibility:8": "ALWAYS"
    }
  },
  "rewards:9": {},
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "taskID:8": "bq_standard:checkbox"
    }
  }
}