{
  "preRequisites:11": [
    631
  ],
  "properties:10": {
    "betterquesting:10": {
      "desc:8": "§oThe final processing line, at last!§r\n\nProduction of §aSterilized Growth Medium§r is the final processing line in GTCEu, for now at least...\n\nYou will need this for §4Wetware Circuits§r.\n\nProducing it is not nearly as difficult as PBI, but nearly every step requires a Sterilized Cleanroom. This means you\u0027ll have to get creative with how you use your space.\n\nMake sure to look at every recipe for every step. Some inputs are much more effective than others!\n\nIf you\u0027re not sure how to automate §eMince Meat§r, I\u0027ll refer you to the Fisher Quest.\n\n§ePro Tip§r: You can wall-share cleanrooms, with doors in-between too, if you want more space.\n\n§bLore§r: GTCEu\u0027s Sterilized Growth Medium chain is loosely based off of Bartworks\u0027 from GTNH. The main difference is that GTNH required a Bacterial Vat multiblock, which was more complex than the ordered Assembly Line! GTCEu is considering adding a multiblock like it but with their own spin in the future.\n\n§bMore Lore§r: In Gregicality Legacy, the Sterilized Growth Medium production chain was very different. It was one of the most difficult processes in the mod, with over 30 complicated steps! It was based off of producing different real-life vitamins and nutrients.\n\n§bEven More Lore§r: In Shadows of Greg, this was made with just Distilled Water and Mince Meat! Oh how far we have come...",
      "frame:8": "GATE",
      "icon:10": {
        "Count:3": 1,
        "Damage:2": 84,
        "id:8": "gregtech:meta_item_1",
        "tag:10": {
          "Fluid:10": {
            "Amount:3": 1000,
            "FluidName:8": "sterilized_growth_medium"
          }
        }
      },
      "ismain:1": 1,
      "name:8": "Sterlized Growth Medium",
      "visibility:8": "ALWAYS"
    }
  },
  "questID:3": 654,
  "tasks:9": {
    "0:10": {
      "index:3": 0,
      "requiredFluids:9": {
        "0:10": {
          "Amount:3": 1000,
          "FluidName:8": "sterilized_growth_medium"
        }
      },
      "taskID:8": "bq_standard:fluid"
    }
  }
}